import React, {  createContext, useState } from "react";

export const Context = createContext();
export function ContextProvider(props) {
  const [data, setData] = useState([
    {
      id: "1",
      title: "گوشی آیفون 11",
      images: [
        "../../public/images/1.jpg",
        "../../public/images/2.jpg",
        "../../public/images/3.jpg",
      ],
      description:
        "این گوشی موبایل است و خیلی زیباست و جدیدترین محصول شرکت خوب ماست ",
      content:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد",
      colors: ["blue", "red", "orange"],
      price: 180000,
      count: 1,
    },
    {
      id: "2",
      title: "گوشی آیفون 7",
      images: [
        "../../public/images/4.jpg",
        "../../public/images/5.jpg",
      ],
      description:
        "این گوشی موبایل است و خیلی زیباست و جدیدترین محصول شرکت خوب ماست ",
      content:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد",
      colors: ["red", "blue", "orange"],
      price: 150000,
      count: 1,
    },
    {
      id: "3",
      title: "گوشی آیفون 12",
      images: [
        "../../public/images/6.jpg",
        "../../public/images/7.jpg",
        "../../public/images/8.jpg",
      ],
      description:
        "این گوشی موبایل است و خیلی زیباست و جدیدترین محصول شرکت خوب ماست ",
      content:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد",
      colors: ["red", "blue", "orange"],
      price: 345000,
      count: 1,
    },
    {
      id: "4",
      title: "گوشی سامسونگ s21",
      images: [
        "../../public/images/9.jpg",
        "../../public/images/10.jpg",
        "../../public/images/11.jpg",
      ],
      description:
        "این گوشی موبایل است و خیلی زیباست و جدیدترین محصول شرکت خوب ماست ",
      content:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد",
      colors: ["red", "blue", "orange"],
      price: 80000,
      count: 1,
    },
  ]);
  return (
     <Context.Provider value={[data , setData]}>
        {props.children}
     </Context.Provider>
    );
}
